/* No comment provided by engineer. */
"kFWAppMainEZIsRunning" = "KCPM Utility Pro EZInstaller is running";

/* No comment provided by engineer. */
"kFWAppMainEZIsRunningDescription" = "KCPM Utility Pro can not be opened when KCPM Utility Pro EZInstaller is running.";

/* No comment provided by engineer. */
"kFWBooterConfigVCB0RebootOnPanic" = "B0: Reboot on Kernel Panic";

/* No comment provided by engineer. */
"kFWBooterConfigVCB1HiDPI" = "B1: Use HiDPI Mode on Boot";

/* No comment provided by engineer. */
"kFWBooterConfigVCB2Black" = "B2: Hide Progress Bar on Boot";

/* No comment provided by engineer. */
"kFWBooterConfigVCB3CSRActiveConfig" = "B3: Read Active SIP Configurations";

/* No comment provided by engineer. */
"kFWBooterConfigVCB4CSRConfigMode" = "B4: Allow Configuring SIP [Recovery]";

/* No comment provided by engineer. */
"kFWBooterConfigVCB5CSRBoot" = "B5: Disable SIP [Recovery]";

/* No comment provided by engineer. */
"kFWBooterConfigVCB6BlackBackground" = "B6: Use Black Background on Boot";

/* No comment provided by engineer. */
"kFWBooterConfigVCB7LoginUI" = "B7: Use Login UI as Background on Boot";

/* No comment provided by engineer. */
"kFWBooterConfigVCB8InstallUI" = "B8: Install UI [UNKNOWN]";

/* No comment provided by engineer. */
"kFWDetailedResultsVCCorrectValue" = "Correct Value";

/* No comment provided by engineer. */
"kFWDetailedResultsVCCurrentValue" = "Current Value";

/* No comment provided by engineer. */
"kFWDetailedResultsVCFileStatus" = "Status";

/* No comment provided by engineer. */
"kFWDetailedResultsVCNewValue" = "New Value";

/* No comment provided by engineer. */
"kFWDetailedResultsVCOK" = "OK";

/* No comment provided by engineer. */
"kFWDetailedResultsVCPath" = "Path";

/* No comment provided by engineer. */
"kFWDetailedResultsVCReason" = "Reason";

/* No comment provided by engineer. */
"kFWDetailedResultsVCRepairPermissionsResults" = "Repair Permissions Results";

/* No comment provided by engineer. */
"kFWDetailedResultsVCReport" = "Report";

/* No comment provided by engineer. */
"kFWInstallationVCBackupKexts" = "Backup Kexts that will be replaced.";

/* No comment provided by engineer. */
"kFWInstallationVCChoose" = "Choose";

/* No comment provided by engineer. */
"kFWInstallationVCClear" = "Clear";

/* No comment provided by engineer. */
"kFWInstallationVCDrag2Install" = "> Drag to install";

/* No comment provided by engineer. */
"kFWInstallationVCEZModeEnabled" = "EZ Mode: Enabled";

/* No comment provided by engineer. */
"kFWInstallationVCEZModeEnabledSuccessfully" = "😀 EZ Mode has been enabled successfully.";

/* No comment provided by engineer. */
"kFWInstallationVCFailedToBackupKexts" = "Failed to backup the following kexts: ";

/* No comment provided by engineer. */
"kFWInstallationVCFailedToInstallKexts" = "Failed to install the following kexts: ";

/* No comment provided by engineer. */
"kFWInstallationVCInstallKexts" = "Install Kexts...";

/* No comment provided by engineer. */
"kFWInstallationVCInstallKexts2EE" = "Install Kexts to /Extra/Extensions/";

/* No comment provided by engineer. */
"kFWInstallationVCInstallKexts2LE" = "Install Kexts to /Library/Extensions/";

/* No comment provided by engineer. */
"kFWInstallationVCInstallKexts2SLE" = "Install Kexts to /System/Library/Extensions/";

/* No comment provided by engineer. */
"kFWInstallationVCKextName" = "Kext Name";

/* No comment provided by engineer. */
"kFWInstallationVCKextPath" = "Kext Path";

/* No comment provided by engineer. */
"kFWInstallationVCKextVersion" = "Kext Version";

/* No comment provided by engineer. */
"kFWInstallationVCPreference" = "Installation Preferences...";

/* No comment provided by engineer. */
"kFWInstallationVCPreparingKexts" = "kFWInstallationVCPreparingKexts";

/* No comment provided by engineer. */
"kFWInstallationVCSelect" = "Select";

/* No comment provided by engineer. */
"kFWInstallationVCSelectKexts" = "Select Kexts to install...";

/* No comment provided by engineer. */
"kFWMainAboutVCClose" = "Close";

/* No comment provided by engineer. */
"kFWMainAboutVCCompatibility" = "This tool can NOT be used in PE.      macOS Sierra Ready: ✓";

/* No comment provided by engineer. */
"kFWMainAboutVCDeveloperInfo" = "Developed by FireWolf";

/* No comment provided by engineer. */
"kFWMainAboutVCVersion" = "Version: ";

/* No comment provided by engineer. */
"kFWMainAboutVCVisitFireWolfPl" = "Visit FireWolf Pl.";

/* No comment provided by engineer. */
"kFWMainAbstractBackingUpKexts" = "Backing up Kexts...";

/* No comment provided by engineer. */
"kFWMainAbstractInstallingKexts" = "Installing Kexts...";

/* No comment provided by engineer. */
"kFWMainAbstractMaintenanceVCExecute" = "Execute";

/* No comment provided by engineer. */
"kFWMainAbstractMaintenanceVCReady" = "Ready";

/* No comment provided by engineer. */
"kFWMainAbstractMaintenanceVCReset" = "Reset";

/* No comment provided by engineer. */
"kFWMainAbstractMaintenanceVCSelectedVolumeIsNotValid" = "Selected volume is not a valid system volume.";

/* No comment provided by engineer. */
"kFWMainAbstractMaintenanceVCSelectedVolumeIsRecoveryVolume" = "Selected volume is a Recovery volume.";

/* No comment provided by engineer. */
"kFWMainAbstractMaintenanceVCSelectTargetSystemVolume" = "Select a system volume...";

/* Status:  */
"kFWMainAbstractMaintenanceVCStatus" = "Status: ";

/* No comment provided by engineer. */
"kFWMainAbstractRepairingPermissions" = "Repairing Permissions...";

/* No comment provided by engineer. */
"kFWMainAbstractRootlessVCApplyViaConfig" = "Apply via Bootloader";

/* No comment provided by engineer. */
"kFWMainAbstractRootlessVCApplyViaNVRAM" = "Apply via NVRAM";

/* Current Value:  */
"kFWMainAbstractRootlessVCCurrentValue" = "Current Value: ";

/* New Value:  */
"kFWMainAbstractRootlessVCNewValue" = "New Value: ";

/* No comment provided by engineer. */
"kFWMainAbstractRootlessVCRefresh" = "Read / Refresh";

/* No comment provided by engineer. */
"kFWMainAbstractRootlessVCSelectBootloaderConfiguration" = "Select a bootloader configuration...";

/* No comment provided by engineer. */
"kFWMainAbstractRootlessVCUnsupportedBootloaderConfiguration" = "The bootloader configuration you selected is not supported now.";

/* No comment provided by engineer. */
"kFWMainAbstractVCAnErrorOccured" = "An error occured";

/* No comment provided by engineer. */
"kFWMainAbstractVCFinished" = "Finished";

/* No comment provided by engineer. */
"kFWMainAbstractVCRebuildingCaches" = "Rebuilding Caches...";

/* No comment provided by engineer. */
"kFWMainAbstractVCSelect" = "Select";

/* No comment provided by engineer. */
"kFWMainBooterConfig" = "BooterConfig";

/* No comment provided by engineer. */
"kFWMainCommandLineTools" = "Command Line Tools";

/* No comment provided by engineer. */
"kFWMainCommandLineToolsVCChecking" = "Checking...";

/* No comment provided by engineer. */
"kFWMainCommandLineToolsVCCurrentVersion" = "Current Version: ";

/* No comment provided by engineer. */
"kFWMainCommandLineToolsVCFailedToFetchURLFromRemoteServer" = "Failed to fetch data from the remote server.";

/* No comment provided by engineer. */
"kFWMainCommandLineToolsVCFailedToReadDownloadedData" = "Failed to read the downloaded data.";

/* No comment provided by engineer. */
"kFWMainCommandLineToolsVCFailedToSaveDownloadedData" = "Failed to save the downloaded data.";

/* No comment provided by engineer. */
"kFWMainCommandLineToolsVCFailedToUnzipDownloadedData" = "Failed to unzip the downloaded data.";

/* No comment provided by engineer. */
"kFWMainCommandLineToolsVCInstalledVersion" = "Installed Version: ";

/* No comment provided by engineer. */
"kFWMainCommandLineToolsVCIntegratedCommandLineToolStatus" = "Integrated Command Line Tool Status";

/* No comment provided by engineer. */
"kFWMainCommandLineToolsVCLatestVersion" = "Latest Version: ";

/* No comment provided by engineer. */
"kFWMainCommandLineToolsVCLocalCommandLineToolStatus" = "Local Command Line Tool (/usr/local/bin) Status";

/* No comment provided by engineer. */
"kFWMainCommandLineToolsVCRemoteCommandLineToolStatus" = "Remote Command Line Tool Status";

/* No comment provided by engineer. */
"kFWMainCommandLineToolsVCRepairPermissionsFailedToInstall" = "Failed to install RepairPermissions.";

/* No comment provided by engineer. */
"kFWMainCommandLineToolsVCRepairPermissionsFailedToUninstall" = "Failed to uninstall RepairPermissions.";

/* No comment provided by engineer. */
"kFWMainCommandLineToolsVCRepairPermissionsFailedToUpgrade" = "Failed to upgrade RepairPermissions.";

/* No comment provided by engineer. */
"kFWMainCommandLineToolsVCRepairPermissionsInstalled" = "RepairPermissions has been installed on your computer successfully.";

/* No comment provided by engineer. */
"kFWMainCommandLineToolsVCRepairPermissionsUninstalled" = "RepairPermissions has been uninstalled from your computer successfully.";

/* No comment provided by engineer. */
"kFWMainCommandLineToolsVCRepairPermissionsUpgraded" = "RepairPermissions has been upgraded to the latest version.";

/* No comment provided by engineer. */
"kFWMainInstallation" = "Installation";

/* No comment provided by engineer. */
"kFWMainMaintenance" = "Maintenance";

/* No comment provided by engineer. */
"kFWMainPreferenceVCAllPreferencesHaveBeenResetToFactoryDefaults" = "All preferences have been reset to factory defaults.";

/* No comment provided by engineer. */
"kFWMainPreferenceVCAreYouSureToResetAllPreferences" = "Are you sure you want to reset all existing preferences of KCPM Utility Pro?";

/* No comment provided by engineer. */
"kFWMainPreferenceVCCancel" = "Cancel";

/* No comment provided by engineer. */
"kFWMainPreferenceVCEnableEZMode" = "Enable EZ Mode";

/* No comment provided by engineer. */
"kFWMainPreferenceVCEZInstallationPreference" = "EZ Installation Mode Preference";

/* No comment provided by engineer. */
"kFWMainPreferenceVCFinishedToResetAllPreferences" = "All settings have been deleted.\n\nPlease restart the KCPM Utility Pro.";

/* No comment provided by engineer. */
"kFWMainPreferenceVCKextsBackupFolder" = "Kexts Backup Folder Preference";

/* No comment provided by engineer. */
"kFWMainPreferenceVCMaximumNumberOfThreads" = "Maximum number of threads: ";

/* No comment provided by engineer. */
"kFWMainPreferenceVCRepairPermissionsPreferences" = "Repair Permissions Preference";

/* No comment provided by engineer. */
"kFWMainPreferenceVCReset" = "Reset";

/* No comment provided by engineer. */
"kFWMainPreferenceVCResetAllPreferences" = "Reset All Preferences";

/* No comment provided by engineer. */
"kFWMainPreferenceVCResetPreference" = "Reset (For Debugging Purposes Only)";

/* No comment provided by engineer. */
"kFWMainPreferenceVCResetToFactoryDefaults" = "This will delete all existing settings, returning them to factory defaults.\n\nThis function is designed only for debugging purposes!";

/* No comment provided by engineer. */
"kFWMainPreferenceVCSelectedDirectoryIsNotWritable" = "Selected directory is not writable.";

/* No comment provided by engineer. */
"kFWMainPreferenceVCSilenceSIPWarning" = "Silence the SIP warning at the startup";

/* No comment provided by engineer. */
"kFWMainPreferenceVCSIPWarningPreference" = "SIP Warning Preference";

/* No comment provided by engineer. */
"kFWMainPreferenceVCThreads" = "thread(s)";

/* No comment provided by engineer. */
"kFWMainSIPConfig" = "Rootless/SIP";

/* No comment provided by engineer. */
"kFWMaintenanceVCNoOperationsSelected" = "You have not selected any operation.";

/* No comment provided by engineer. */
"kFWMaintenanceVCRebuildCaches" = "Rebuild system and kexts caches of the target volume";

/* No comment provided by engineer. */
"kFWMaintenanceVCRepairDiskPermissions" = "Repair file permissions of the target volume";

/* No comment provided by engineer. */
"kFWMaintenanceVCRepairDiskPermissionsDescription" = "Repair permissions of the whole volume. May take some time.";

/* No comment provided by engineer. */
"kFWMaintenanceVCRepairExtraFolder" = "Repair /Extra folder";

/* No comment provided by engineer. */
"kFWMaintenanceVCRepairExtraFolderDescription" = "Repair permissions of /Extra folder only.";

/* No comment provided by engineer. */
"kFWMaintenanceVCRepairLEFolder" = "Repair /Library/Extensions folder";

/* No comment provided by engineer. */
"kFWMaintenanceVCRepairLEFolderDescription" = "Repair permissions of /Library/Extensions folder only.";

/* No comment provided by engineer. */
"kFWMaintenanceVCRepairPermissions" = "Repair Permissions";

/* No comment provided by engineer. */
"kFWMaintenanceVCRepairSLEFolder" = "Repair /System/Library/Extensions folder";

/* No comment provided by engineer. */
"kFWMaintenanceVCRepairSLEFolderDescription" = "Repair permissions of /System/Library/Extensions folder only.";

/* No comment provided by engineer. */
"kFWMaintenanceVCSelectedOperationsFinished" = "Selected operations were finished.";

/* No comment provided by engineer. */
"kFWMaintenanceVCSelectTheOperations" = "Select the operations...";

/* No comment provided by engineer. */
"kFWSIPConfigVCB0AllowUntrustedKexts" = "B0: Allow Untrusted Kexts";

/* No comment provided by engineer. */
"kFWSIPConfigVCB1AllowUnrestrictedFileSystem" = "B1: Allow Unrestricted File System Access";

/* No comment provided by engineer. */
"kFWSIPConfigVCB2AllowTaskForPID" = "B2: Allow task_for_pid()";

/* No comment provided by engineer. */
"kFWSIPConfigVCB3AllowKernelDebugger" = "B3: Allow Kernel Debugging";

/* No comment provided by engineer. */
"kFWSIPConfigVCB4AllowAppleInternal" = "B4: Allow Apple Internal";

/* No comment provided by engineer. */
"kFWSIPConfigVCB5AllowUnrestrictedDtrace" = "B5: Allow Unrestricted dtrace";

/* No comment provided by engineer. */
"kFWSIPConfigVCB6AllowUnrestrictedNVRAM" = "B6: Allow Unrestricted NVRAM";

/* No comment provided by engineer. */
"kFWSIPConfigVCB7AllowDeviceConfiguration" = "B7: Allow Device Configuration";

/* No comment provided by engineer. */
"kFWSIPConfigVCB8PlaceholderBaseSystem" = "B8: BaseSystem Verification (as of 10.12)";

"kFWInstallationVCSelectedKextsInstalledOperationsAllFinished" = "All dragged Kernel Extensions have been installed successfully.\nFile permissions were repaired. Kernel caches have been rebuilt successfully.";

"Owner ID Mismatched" = "Owner ID Mismatched";

"Group ID Mismatched" = "Group ID Mismatched";

"POSIX Permissions Mismatched" = "POSIX Permissions Mismatched";

"Verified" = "Verified";

"Fixed" = "Fixed";

"Failed" = "Failed";

"kFWXPCHelperManagerAnErrorOccured" = "An error occured";

"kFWXPCHelperManagerFailedToConnectToHelper" = "KCPM Utility Pro cannot connect to the helper. ";

"kFWXPCHelperManagerFailedToInstallHelper" = "KCPM Utility Pro cannot install the helper.";

"kFWXPCHelperManagerFailedToReinstallHelper" = "KCPM Utility Pro cannot install a new helper.";

"kFWXPCHelperManagerFailedToRemoveHelper" = "KCPM Utility Pro cannot remove the existing helper.";

"kFWXPCHelperManagerFailedToAuthenticate" = "KCPM Utility Pro failed to authenticate with the operating system.";

"kFWMainCommandLineToolsVCInstall" = "Install";

"kFWMainCommandLineToolsVCUninstall" = "Uninstall";

"kFWMainCommandLineToolsVCUpgrade" = "Upgrade";
/**/
"kFWSIPConfigVCNewSIPConfigNotExist" = "You haven't selected any new SIP configuration.";

"kFWBooterConfigVCNewBooterConfigNotExist" = "You haven't selected any new booter configuration.";

"kFWSIPConfigVCNewSIPConfigSavedViaBootloaderConfig" = "New SIP settings have been saved via your bootloader configuration.\n\nNew configuration will take effect after you restart your computer.";

"kFWSIPConfigVCNewSIPConfigFailedToSaveViaBootloaderConfig" = "Failed to save the new SIP settings via your bootloader configuration.";

"kFWBooterConfigVCNewBooterConfigSavedViaBootloaderConfig" = "New booter settings have been saved via your bootloader configuration.\n\nNew configuration will take effect after you restart your computer.";

"kFWBooterConfigVCNewBooterConfigFailedToSaveViaBootloaderConfig" = "Failed to save the new booter settings via your bootloader configuration.";

"kFWBooterConfigVCBooterConfigNotSupportedByChameleon" = "Chameleon does not support setting booter configuration.";

"kFWBooterConfigVCBooterConfigAppliedViaNVRAM" = "New booter settings have been applied via NVRAM.\n\nNew configuration will take effect after you restart your computer.";

"kFWBooterConfigVCBooterConfigFailedToApplyViaNVRAM" = "Failed to apply the new booter settings via NVRAM.";

"kFWSIPConfigVCApplySIPViaNVRAMUnsupported" = "Modifying SIP settings in normal boot mode is not supported due to Apple's security policy. \n\nThis function is only available in OS X Recovery Boot / FireWolf OS X PE mode.";

"kFWSIPConfigVCSIPStatusFull" = "System Integrity Protection Status";

"kFWBooterConfigVCBooterConfigStatusFull" = "Booter Configuration Status";

"kFWAppMainSIPConfigurationWarning" = "System Integrity Protection Warning";

"kFWAppMainFoundSIPB0Disabled" = "[B0: Allow Unrestricted Kexts] is currently disabled. Installing kernel extensions may not function properly.";

"kFWAppMainFoundSIPB1Disabled" = "[B1: Allow Unrestricted File System] is currently disabled. Repairing permissions and installing kernel extensions may not function properly.";

"kFWMaintenanceVCRebuildCachesTitle" = "Rebuild Caches";

"kFWAppMainRequestAuthorization" = "KCPM Utility Pro requires your permission to perform installation and maintenance.";

"kFWAppMainAboutKCPMP" = "About KCPM Utility Pro";

"kFWAppMainCheckForUpdates" = "Check for Updates...";

"kFWAppMainPreferences" = "Preferences";

"kFWAppMainHideKCPMP" = "Hide KCPM Utility Pro";

"kFWAppMainHideOthers" = "Hide Others";

"kFWAppMainShowAll" = "Show All";

"kFWAppMainQuitKCPMP" = "Quit KCPM Utility Pro";

"kFWAppMainView" = "View";

"kFWAppMainShowToolbar" = "Show Toolbar";

"kFWAppMainCustomize" = "Customize Toolbar";

"kFWAppMainWindow" = "Window";

"kFWAppMainMinimize" = "Minimize";

"kFWAppMainZoom" = "Zoom";

"kFWAppMainBringAllToFront" = "Bring All to Front";